UTAF_Base/requestFiles/BPS_UsagePlan_Delete.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:v4.context.vss.objects.bgc" xmlns:urn1="urn:v3.usageplan.bps.services.bgc" xmlns:urn2="urn:v1.crdmodel.bps.objects.bgc">
   <soapenv:Header>
      <urn:Context version="4.0">
         <urn:correlationId>${Req_corrId}</urn:correlationId>
         <urn:consumerApplicationId>BPS</urn:consumerApplicationId>
         <urn:endUserId>id058127</urn:endUserId>
         <urn:endUserLanguage>EN</urn:endUserLanguage>
         <urn:propagatedKey>${Req_propagatedKey}</urn:propagatedKey>
      </urn:Context>
   </soapenv:Header>
   <soapenv:Body>
      <urn1:RequestDataDelete version="3.0">
         <urn1:userContext>
            <urn2:applicationNm>BPS</urn2:applicationNm>
            <urn2:correlationId>${Req_corrId}</urn2:correlationId>
            <urn2:userId>id058127</urn2:userId>
            <urn2:languageIso2Code>EN</urn2:languageIso2Code>
         </urn1:userContext>
         <urn1:usagePlanId>${Req_usagePlanId}</urn1:usagePlanId>
         <urn1:startDate>${Req_startDate}</urn1:startDate>
         <urn1:modTime>${Req_modTime}</urn1:modTime>
      </urn1:RequestDataDelete>
   </soapenv:Body>
</soapenv:Envelope>